# Напишите программу, которая принимает на вход координаты двух точек и 
# находит расстояние между ними в 2D пространстве.

# Пример:

# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21




print("Введите координаты точки 1")
a1 = int(input())
b1 = int(input())
print("Введите координаты точки 2")
a2 = int(input())
b2 = int(input())


list1 = [a1,b1]
list2 = [a2,b2]

dists = ((list2[0] - list1[0]) ** 2 + (list2[1] - list1[1]) ** 2) ** (0.5)
print(dists)
