# Напишите программу, которая найдёт произведение пар чисел списка. 
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.

# Пример:

# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]


list = [2, 3, 4, 5, 6]
res1 = 0
res2 = 0
res3 = 0
i=4        
for i in range(len(list)):
    res1 = res1 + list[0] * list[4]
    res2 = res2 + list[1] * list[3]
    res3 = res3 + list[2] * list[2]
    print(f' [{res1}, {res2}, {res3}]')
    exit()